# KeyError - възниква, когато е имало проблем при извиличането на ключа, който търсите
# AttributeError - възниква, когато препратка към атрибут или присвояване е неуспешно.
# ValueError - възниква, когато функция получи аргумент от правилния тип данни, но неподходяща стойност
# NameError - възниква, когато се опитате да използвате променлива, функция или модул, които не съществуват или не са използвани по валиден начин
# TypeError - възниква, когато типът данни на обект в операция е неподходящ
# IndexError - възниква в Python, когато се направи опит за достъп до елемент от списък, който е извън обхвата на индекса на списъка
# ModuleNotFoundError - възниква, когато се опитвате да получите достъп или да използвате модул, който не може да бъде намерен
# ZeroDivisionError - възниква, когато число бива разделено на 0
# RuntimeError възниква, когато Python разбира какво казвате, но среща проблеми, когато следва вашите инструкции
# FileNotFoundError - възниква, когато се опитвате да изпълните команда, която изисква файл, който системата не може да намери
# OSError - възниква, когато специфична системна функция на операционната система връща свързана със системата грешка, включително входно/изходни повреди като „file not found“ или „disk full"